module.exports.config = {
    name: 'autotime',
    version: '10.02',
    hasPermssion: 0,
    credits: 'simanto',
    description: 'সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠান!',
    commandCategory: 'group messenger',
    usages: '[]',
    cooldowns: 3
};
const nam = [{
    timer: '1:00:00 AM',
    message: ['~ এখন রাত ১২টা বাজে সবাই ঘুমায় পড়ো অনেক রাত হয়েছে😍 <3.']
},
             {
    timer: '2:00:00 AM',
    message: ['~ এখন রাত ১টা অনেকেই জেগে আছো যাদের মনে অনেক কষ্ট😊 <3.']
},
						{
    timer: '3:00:00 AM',
    message: ['~ এখন রাত ২টা বেজে গেলো🤟<3.']
},
						 {
    timer: '4:00:00 AM',
    message: ['~উফস গভির রাত এখন রাত ৩টা বাজে বউ থাকলে কি যে মজা হতো👀 😊 <3.']
},
						 {
    timer: '5:00:00 AM',
    message: ['~ এখন ভোর ৪টা বাজে তোমরা কি এখনও ঘুমাও😊 <3.']
},
						 {
    timer: '6:00:00 AM',
    message: ['~ এখন সকাল ৫টা বাজে সবাই ফজরের নামাজ পড়ে নেন😻 <3.']
},
						 {
    timer: '7:00:00 AM',
    message: ['~ এখন সকাল ৬টা বাজে শুভ সকাল😍 <3.']
},
						 {
    timer: '8:00:00 AM',
    message: ['~ এখন সকাল ৭টা বাজে সবাই হালকা নাস্তা করো চা বিস্কুট খাও❤️ <3.']
},
						 {
    timer: '9:00:00 AM',
    message: ['~ এখন সকাল ৮টা বাজে সবাই ব্রেকফাস্ট করে নাও <3.']
},
						{
    timer: '10:00:00 AM',
    message: ['~ এখন সময় সকাল ৯টা সবাই সবার কাজে যাও😊 <3.']
}
             {
    timer: '11:00:00 AM',
    message: ['~এখন সকাল ১০ টা বাজে সবাই মনে হয় কাজে ব্যস্ত' ]
},
						 {
    timer: '12:00:00 PM',
    message: ['~ এখন সকাল ১১ টা বাজে❤️ <3.']
},
						 {
    timer: '1:00:00 PM',
    message: ['~ এখন দুপুর ১২টা বাজে <3.']
},					
						 {
    timer: '2:00:00 PM',
    message: ['~ এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে যোহরের নামাজ পড়ে নিন😍 <3.']
},
						 {
    timer: '3:00:00 PM',
    message: ['~ এখন দুপুর ২টা বাজে সবাই দুপুরে খাওয়া শেষ করুন❤️ <3.']
},
						 {
    timer: '4:00:00 PM',
    message: ['~ এখন দুপুর ৩টা বাজে☺️ <3.']
},
						 {
    timer: '5:00:00 PM',
    message: ['~ এখন বিকাল ৪টা বাজে ❤️ <3.']
},
						{
    timer: '6:00:00 PM',
    message: ['~ এখন বিকাল ৫টা বাজে সবাই সবার বাসায় থাকুন এখন থেকে! এবং আসরের নামাজ পড়ে নিন😍 <3.']
},
						 {
    timer: '7:00:00 PM',
    message: ['~ এখন সন্ধ্যা ৬টা বাজে মাগরিবের নামাজ পড়ে নিন <3.']
},
						 {
    timer: '8:00:00 PM',
    message: ['~ এখন সন্ধ্যা ৭টা বাজে সবাই হালকা নাস্তা করে নাও🤓 এবং একটু পর আযান দিলে এশার নামাজ পড়ে নিও<3.']
},
             {
    timer: '9:00:00 PM',
    message: ['এখন রাত ৮টা বাজে.']
},
             {
    timer: '10:00:00 PM',
    message: ['~ এখন রাত ৯ টা বাজে কি করছে সবাই❤️🌇']
},
             {
    timer: '11:00:00 PM',
    message: ['দেরী হয়ে গেছে, অনেক রাত চলো বিছানায় যাই! আমার তো বউ নাই তাই কোলবালিশ কোলে নিয়ে ঘুমাবো😴 বিয়ে করবো 10 বছরের মধ্যে সবাই আমার জন্য দোয়া করবা❤️😊']
},
            {
    timer: '12:00:00 AM',
    message: ['~ এখন রাত ১১টা বাজে সবাই কি শুয়ে পড়ছেন? ,']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};